Application/services/shared/__tests__/artillery/test4/artilleryTest - 4.yaml
config:
  target: 'http://localhost:4000'  
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Phase 1: 100 users"
    - duration: 60
      arrivalRate: 150
      name: "Phase 2: 150 users"
    - duration: 60
      arrivalRate: 200
      name: "Phase 3: 200 users"

scenarios:
  - flow:
      - get:
          url: "/api/storefront/media/autoComplete?chars=the"  
          headers:
            If-None-Match: ""